stop_words = ["እኔ", "የኔ", "እኛ", "እሱ", "ራሱ", "ጋር", "ስለ", "ወደ", "ታች", "የት", "የእኛ", "የእኛ",
              "እራሳችን", "እርስዎ", "የእርስዎ", "የእርስዎ", "እራስዎ", "እናንተ", "የእርሱ", "የእሷ", "እራሷ",
              "የራሱ", "እነሱ", "እነሱ", "የእነሱ", "የእነሱ", "ራሳቸው", "የትኛው", "እነዚህ", "እነዚያ", "ናቸው",
              "ነበሩ", "ነበሩ", "መሆን", "መሆን", "መሆን", "አለን", "አግኝተናል", "ያደርጋል", "አደረገ", "ማድረግ",
              "አንድ", "አንድ", "ከሆነ", "ወይም", "ምክንያቱም", "እንደ", "እስከ", "እያለ", "ተቃዋሚ", "መካከል",
              "በኩል", "ወቅት", "በፊት", "በኋላ", "በላይ", "በታች", "እስከ", "እንደገና", "ተጨማሪ", "ከዚያ", "አንዴ",
              "እዚህ", "ለምን", "እንዴት", "ማንኛውም", "ሁለቱም", "እያንዳንዳቸው", "ጥቂቶች", "የበለጠ", "በጣም",
              "አንዳንድ", "እንደዚህ", "የለም", "ወይም", "አይደለም", "የራሱ", "ተመሳሳይ", "ስለዚህ"]


def stop_word_check(w):
    if w in stop_words:
        return True
    else:
        return False
