#import nltk
#from amharic_tokenizer import *
from nltk import *
sm = """አባተ     አባይ     አባይነህ     አብደላ     አብዲ      አብዱ      አብዱል
    አብዱላሂ      አበበ      አበጋዝ     አቤል    አብነት   አቤነዘር   አበራ አብይ    አብራሃም     አቡበከር    አዳነ    አዲሱ    አድማሱ"
    አዱኛ     አፈወርቅ    አህመድ   አካሉ    አክሊሉ   አላዛር
    አለባቸው   ባህሩ   በፈቃዱ   በሃይሉ   በቀለ   በቂላ   በላቸው
    በላይ  በላይነህ   በለጠ    በእምነት   በረከት  ብርሃኑ   በርሄ
    በሱፈቃድ    ቤተአብ    በየነ    ቢኒያም   ብሩክ   ብስራት   ካሌብ
    ጫንያለው     ጨቡዴ     ቸርነት    ዳግም     ዳግማዊ    ዳኛቸው
    ዳንኔል    ዳዊት    ደበበ    ደጀን    ደመቀ    ደምረው   ደምሴ
    ደረጄ    ደስአለኝ    ደስታ    ዲባባ   ድልነሳው   ኤፍሬም   ኤሊያስ
    እንዳለ    እንዳልካቸው    እንድርያስ    ኤርሚያስ    እሸቴ   እሸቱ
    እስክንድር     እስጢፋኖስ     እያሱ     እዮቤል    ኢዛና     እዝራ
    ፋሲል     ፈድሉ    ፈገግታ     ፍቅረ_ማርያም    ፍቅረ_ስላሴ   ፍቃዱ
    ፍቅሩ    ፍሰሀ     ፍፁም    ፍሬዘር    ጋሻው    ገብረ_እግዚያቤር
    ገብረ-ጊዮርጊስ    ገብረ-ማርያም   ገብረ-መስቀል   ገበረ_ሚኬኤል
    ገብረ-ስላሴ     ጌዲኦን     ገመቹ    ጌታቸው     ጌታሁን     ጌትነት
    ገዛኸኝ     ግርማ    ግርማቸው     ግሩም    ግዛቸው     ጎሳዬ
    ሀብታሙ     ሀብቴ     ሀጎስ     ሃይሌ     ኃይለ-ማርያም
    ኃይለ_ስላሴ     ሃይሌ      ሀሰን      ሄኖክ     ህሩይ     ሁሴን
    ኢብራሂም       ኢሳያስ      እስራኤል      ኢሳቅ      ጀማል
    ቃኘው      ካሳሁን      ካሳዬ      ከበደ     ኬብሮን      ከፍያለው
    ከተማ      ቅዱስ      ክፍሌ     ኪሮስ       ኪሩቤል     ካሊድ
    ላቀ      ለገሰ      ለማ       ልኡል      ሊቁ       ማሞ     ማሙሽ
    ማርቆስ      ማትዮስ      መብራቱ     መድህን     መሀሪ
    መክብብ        መኮንን     መኩሪያ      መላኩ      ሚንሊክ
    መንግስቱ     መርሻ       መሳይ      መስፍን       መታፈሪያ
    መዝገበ        ሚኬኤል      ሚኪያስ      ሚሊዮን         ምንተስኖት
    ምትኩ      ሞገስ       መሀመድ     ሞላልኝ      ሞላ     ሙሉጌታ  ሙሉቀን      ሙሴ      ናሆም      ናትናዬል      ነቢል      ነብዩ
    ነብያት      ነጋ        ነጋሽ      ንጉሴ      ኖላዊ     ጳውሎስ
    ጴጥሮስ     ረድኤት    ሬድዋን     ሮቤል    ሳምሶን    ሳሙኤል
    ስብሃት      ሰብስቤ      ሰኢድ      ሰይፉ       ሰላም     ስዩም
    ሸዋንግዛው     ሽፈራው      ሽመልስ      ሲሞን      ስንታየሁ
    ሲራጅ        ሲሳይ       ሶፎንያስ      ሰለሞን     ሱራፌል
    ታደለ      ታደሰ      ታመነ       ታምራት      ታረቀኝ
    ታሪክ       ታሪኩ       ታየ       ተፈራ      ተፈሪ       ተከስተ
    ተመስገንም     ተሰማ      ተስፋዬ      ተሾመ     ቴዎድሮስ
    ቶማስ      ጥበቡ       ጥላሁን        ጸጋዬ       ዋሲሁን
    ወልደ-ጊዮርጊስ       ወንደሰን      ወርቅነህ      ወርቁ      ወሰን
    ያፌት      ያዕቆብ      ያሬድ      ይልቃል      ይድነቃቸው    ይትባረክ
    ዮሃንስ       ዮናስ        ዮናታን       ዮሴፍ       ዘካሪያስ      ዘላለም ዘለቀ   ዘሪሁን  ዘውዱ """
sf = """ 
     መቀበል    ተቀበለች      ተቀበለ     ተቀበሉ ተቀበልኩ
መፍቀድ    ፈቀደች        ፈቀደ       ፈቀዱ ፈቀድኩ
መጠየቅ     ጠየቀች        ጠየቀ      ጠየቁ ጠየቅኩ
ማመን       አመነች        አመነ       አመኑ አመንኩ
መበደር      ተበደረች       ተበደረ     ተበደሩ ተበደርኩ
መስበር       ሰበረች         ሰበረ        ሰበሩ  ሰበርኩ         
ማምጣት     አመጣች     አመጣ      አመጡ አመጣሁ
መግዛት       ገዛች            ገዛ             ገዙ ገዛሁ
መቻል        ቻለች           ቻለ             ቻሉ ቻልኩ
ማቆረጥ    አቆረጠች    አቆረጠ    አቁአረጡ አቆረጥኩ
መለወጥ      ተለወጠች     ተለወጠ      ተለወጡ ተለወጥኩ
ማጽዳት       አጸዳች          አጸዳ         አጸዱ አጸዳሁ
ማበጠር       አበጠረች      አበጠረ       አበጠሩ አበጠርኩ
ማጉረምረም   አጉረመረመች    አጉረመረመ    አጉረመረሙ አጉረመረምኩ
ማሳል      አሳለች       አሳለ     አሳሉ አሰላሁ
 መቁጠር   ቆጠረች     ቆጠረ    ቆጠሩ ቆጠርኩ
መደነስ     ደነሰች      ደነሰ       ደነሱ ደነስኩ
መሳል       ሳለች          ሳለ     ሳሉ ሳልኩ
 መጠጣት   ጠጣች      ጠጣ     ጠጡ ጠጣሁ
 መንዳት     ነዳች          ነዳ        ነዱ ነዳሁ
 መብላት    በላች          በላ       በሉ በላሁ
ማስረዳት   አስረዳች      አስረዳ     አስረዱ አስረዳሁ
 መውደቅ    ወደቀች      ወደቀ       ወደቁ ወደኩ
 መሙላት   ሞላች        ሞላ         ሞሉ ሞላሁ
 ማግኘት     አገኘች        አገኘ        አገኙ አገኘሁ
 መጨረስ        ጨረሰች          ጨረሰ       ጨረሱ ጨረስሁ
 መብቃት        በቃት             በቃው       በቃቸው በቃኝ 
መጠገን          ተጠገነች        ተጠገነ          ተጠገኑ ተጠቀንኩ
መብረር         በረረች           በረረ             በረሩ በረርኩ
 መስራት        ሰራች            ሰራ               ሰሩ ሰራሁ
መስጠት        ሰጠች          ሰጠ                ሰጡ ሰጠሁ
 መሄድ          ሄደች           ሄደ               ሄዱ ሄድኩ
መያዝ             ያዘች          ያዘ             ያዙ ያዝኩ
ማዳመጥ        አዳመጠች    አዳመጠ      አዳመጡ  አዳመጥኩ
መጉዳት          ተጎዳች        ተጎዳ           ተጎዱ ተጎዳሁ
ማወቅ            አወቀች      አወቀ           አወቁ     አወቅኩ
 መማር          ተማረች      ተማረ          ተማሩ ተማርኩ
 መተው         ተወች           ተወ   ተው ተውኩ 
መክፈል     ከፈለች     ከፈለ     ከፈሉ    ከፈልኩ  
መጫወት     ተጫወተች     ተጫወተ    ተጫወቱ    ተጫወትኩ   
ማስቀመጥ    አስቀመጠች     አስቀመጠ    አስቀመጡ    አስቀመትኩ
መዝነብ    ዘነበች     ዘነበ     ዘነቡ     ዘነብኩ
ማንበብ      አነበበች      አነበበ     አነበቡ     አነበብኩ
መመለስ       መለሰች      መለሰ      መለሱ      መለስኩ
መሮጥ       ሮጠች       ሮጠ      ሮጡ        ሮጥኩ     
ማለት      አለች       አለ      አሉ     አልኩ
ማየት       አየች      አየ      አዩ      አየሁ
መሸጥ       ሸጠች      ሸጠ     ሸጡ     ሸጥኩ
መላክ     ላከች     ላከ     ላኩ ላኩኝ 
መፈረም    ፈረመች      ፈረመ     ፈረሙ     ፈረምኩ
መዘመር     ዘመረች      ዘመረ      ዘመሩ    ዘመርኩ
መቀመጥ     ተቀመጠች     ተቀመጠ      ተቀመጡ    ተቀመትኩ
መተኛት       ተኛች     ተኛ     ተኙ     ተኛሁ
ማጨስ     አጨሰች      አጨሰ    አጨሱ    አጨስኩ
መናገር     ተናገረች      ተናገረ     ተናገሩ      ተናገረኩ
ማውጣት     አወጣች     አወጣ      አወጡ     አወጣሁ
መቆም     አቆመች      አቆመ       አቆሙ     አቆምኩ
መጀመር      ጀመረች       ጀመረ      ጀመሩ      ጀመርኩ
ማጥናት      አጠናች      አጠና      አጠኑ      አጠናሁ
መሳካት       አሳካች      አሳካ      አሳኩ       አሳካሁ
መዋኘት       ዋኘች       ዋኘ        ዋኙ       ዋኘሁ
መውሰድ      ወሰደች        ወሰደ      ወሰዱ       ወሰደኩ
ማውራት       አወራች        አወራ        አወሩ        አወራሁ
ማስተማር       አስተማረች        አስተማረ        አስተማሩ      አስተማረኩ
መንገር       ተናገረች      ተናገረ       ተናገሩ      ተናገርኩ
ማሰብ        አሰበች       አሰበ         አሰቡ         አሰበኩ
መተርጎም       ተረጎመች       ተረጎመ      ተረጎሙ     ተረጎምኩ
መጉዋዝ       ተጟዘች       ተጟዘ       ተጟዙ      ተጟዝኩ
መሞከር       ሞከረች        ሞከረ       ሞከሩ       ሞከረኩ
ማጥፋት      አጠፋች       አጠፋ        አጠፉ      አጠፋሁ
ማብራት       አበራች       አበራ       አበሩ       አበራሁ
መረዳት      ተረዳች       ተረዳ        ተረዱ       ተረዳሁ
መጠቀም      ተጠቀመች        ተጠቀመ       ተጠቀሙ       ተጠቀምኩ
መጠበቅ       ጠበቀች       ጠበቀ      ጠበቁ         ጠበኩ
መንቃት      ነቃች         ነቃ         ነቁ        ነቃሁ
መመኘት       ተመኘች      ተመኘ      ተመኙ     ተመኘሁ      
መስራት     ሰራች      ሰራ      ሰሩ      ሰራሁ     
መጨነቅ       ተጨነቀች        ተጨነቀ        ተጨቁ      ተጨነኩ
መጻፍ        ጻፈች        ጻፈ        ጻፉ           ጻፍኩ
    """
nf = """ 
 አባይነሽ     አበባ      አበባወርቅ      አበባዬ      አበበች
አበራሽ      አበዙ      አቢጌኤል      አቢጊያ     አዳነች
አዲስ      አደይ       አይዳ      አክሊል     አክሱማዊት
አለም     አለሚቱ     አለምነሽ      አለምፀሃይ      አልጋነሽ
አልማዝ       አማረች      አመለወርቅ      አምሳለ   አምሳለወርቅ
አምሳሉ       አርሴማ       አሰገደች      አስናቀች      አስቴር
አጸደ     አየለች       አይናለም       አዛለች        አዜብ  
 በቀለች       በላይነሽ       በለጥሻቸው       በለጡ      በእምነት
ቤተል       ቤተልሄም       በጸጋ       ቤዛ        ቤዛዊት
ቢፍቱ       ብሌን       ብርቱካን       ብዙነሽ      ብሩክታዊት
ጫልቱ        ዳግማዊት      ዲቦራ       ደብሪቱ      ደራርቱ
ደስታ        ድንቅነሽ        ኤደን         ኤዶም        እጅግአየሁ
እልፍነሽ       ኤልሳቤት       ኤልሻዳይ       ኢማን       እስከዳር
እቴነሽ      እፅገነት       እየሩስ        እየሩስአሌም      ፋሲካ
ፍቅር       ፍቅርተ       ፌቨን      ፍሬሂወት       ገሊላ
ገነት      ሀይማኖት      ሀመልማል      ሀመረ     ሀናን
ሀና      ሀረግ      ሀያት       ሄለን      ህሊና
ሄርሜላ      ሄዋን      ሂሩት      ሂወት       እንቁ
ቃልኪዳን       ቀለሟ       ቅድስት       ኮከቤ      ቆንጅት
ልደት       ሊዲያ       ልዕልት      ሊያ        ልዩ
ማህደር      ማህሌት      ማክዳ      ማራኪ      ማርያማዊት
ማርታ      መአዛ       ምህረት      መቅደስ       ሜላት
ሜሮን      መንበረ        መና        ምንትዋብ     መሰሉ
መስከረም       መሰረት       መስተዋት        መታሰቢያ     ምኞቴ
ሚሚ     ምስጋና       ምስራቅ       ሙሉ      ሙሉእመቤት
ሙና      ናኦሚ      ናርዶስ       ነጋሲ      ነፃነት   ንግስት    ኑኑ
ራሄል    ርብቃ    ረዴት    ረቂቅ    ሮማን    ሮዛ    ሩት    ሳባ    ሳሌም   ሳምራዊት    ሳራ    ሳሮን   ሰብለ    ሰብለወንጌል    ሰፋኒት  ሰላም
ሰላማዊት   ሰሚራ  ሰናይት    ስንዱ   ስምረት  ሰርክአዲስ ሰርክአለም
ሲሀም   ስነጥበብ   ስጦታ   ጣይቱ  ተናኝ  ትርሲት   ተዋበች   ትሁት
ትግስት   ትንቢት  ጥሩነሽ    ጥሩወርቅ   ትዝታ   ፀደኒያ   ፀደይ   ጸጋ
ፀሐይ   ፂኦን   ወለላ   ወይንሸት   ውዳሴ   ውለታ  ያብስራ  ያምሮት
የምስራች   የሺ   የሺእመቤት   የውብዳር   ዮዲት   ዮሃና   ዮርዳኖስ
ዘሪቱ    ዘውዲቱ    ዝናሽ    ዙፋን
"""

a=[]
b=[]
f=[]
d=[]
e=[]
x1=[]
x2=[]
x3=[]
x4=[]
x5=[]

#for s in range(4,len(x),5):
   # a.append(x[s])



#print(a)

sc = """ 
አፍጋኒስታን
አልባኒያ
አልጄሪያ
አንዶራ
አንጎላ
አንቲጉአ_እና_ባርቡዳ
አርጀንቲና
አርሜኒያ
አውስትራሊያ
ኦስትራ
አዘርባጃን
ባሐማስ
ባሃሬን
ባንግላድሽ
ባርባዶስ
ቤላሩስ
ቤልጄም
ቤሊዜ
ቤኒኒ
በሓቱን
ቦሊቪያ
ቦስኒያ እና ሔርዞጎቪያ
ቦትስዋና
ብራዚል
ብሩኔይ
ቡልጋሪያ
ቡርክናፋሶ
በርማ
ቡሩንዲ
ካምቦዲያ
ካሜሩን
ካናዳ
ኬፕ_ቬሪዴ
ሴንትራል_አፍሪካ_ሪፑቢሊክ
ቻድ
ቺሊ
ቻይና
ካምቦዲያ
ኮሞሮስ
ኮንጎ
ኮስታ_ሪካ
ኮትዲቫር
ክሮሽያ
ኩባ
ቆጵሮስ
ቼክ ሪፐብሊክ
ዴንማሪክ
ጅቡቲ
ዶሚኒካ
ዶሚኒካን_ሪፐብሊክ
ምስራቅ_ቲሞር
ኢኳዶር
ግብጽ
ኤልሳልቫዶር
ኢኳቶሪያል ጊኒ
ኤርትሪያ
ኢስቶኒያ
ኢትዮጵያ
ፊጂ
ፊኒላንድ
ፈረንሳይ
ጋቦን ጋምቢያ
ጆርጂያ
ጀርመን
ጋና
ግሪክ
ግሪንዳዳ
ጓቴማላ
ጊኒ
ጊኒ_ቢሳው
ጉያና
ሓይቲ
ሆንዱራስ
ሃንጋሪ
አይስላንድ
ሕንድ
ኢንዶኔዥያ
ኢራን
ኢራቅ
አይርላድ
እስራኤል
ጣሊያን
ጃማይካ
ጃፓን
ዮርዳኖስ
ካዛክስታን
ኬንያ
ኪሪባቲ
ሰሜን_ኮሪያ 
ደቡብ_ኮሪያ 
ኵዌት
ክይርጋዝስታን
ላኦስ
ላቲቪያ
ሊባኖስ
ሌስቶ
ላይቤሪያ
ሊቢያ
ለይችቴንስቴይን
ሊቱአኒያ
ሉዘምቤርግ
መቄዶኒያ
ማዳጋስካር
ማላዊ
ማሌዥያ
ማልዲቬስ
ማሊ
ማልታ
ማርሻል_አይስላንድ
ሞሪታኒያ
ሞሪሼስ
ሜክስኮ
ሚክሮኔዥያ
ሞልዶቫ
ሞናኮ
ሞንጎሊያ
ሞንቴኔግሮ
ሞሮኮ
ሞዛምቢክ
ናምቢያ
ናኡሩ
ኔፓል
ኔዜሪላንድ
ኒውዚላንድ
ኒካራጉአ
ኒጀር
ናይጄሪያ
ኖርዌይ
ኦማን
ፓኪስታን
ፓላኡ
ፓናማ
ፓፓዋ ኒው ጊኒ
ፓራጓይ
ፔሩ
ፊሊፕንሲ
ፖላንድ
ፖርቹጋል
ኳታር
ሮማኒያ
ራሽያ
ሩዋንዳ
ሰይንት_ኪትስ_እና_ኔቪስ
ሰይንት_ሉካስ
ሰይንት_ቪንሴንት_እና_ጀሬናዲኔስ
ሳሞአ
ሳን ማሪኖ
ሳኦ ቶሜ እና ፕሪንቺፔ
ሳውዲ ዓረቢያ
ሴኔጋል
ሴርቢያ
ሲሼልስ
ሰራሊዮን
ስንጋፖር
ስሎቫኒካ
ስሎቫኒያ
የሰሎሞን_አይስላንድስ
ሶማሊያ
ደቡብ_አፍሪካ
ስፔን
ሲሪላንካ
ሱዳን
ሱሪናሜ
ስዋዝላድ
ስዊዲን
ስዊዘሪላንድ
ሶሪያ
ታጂኪስታን
ታንዛንኒያ
ታይላንድ
መሄድ
ቶንጋ
ትሪኒዳድ_እና_ቶባጎ
ቱንሲያ
ቱሪክ
ቱርክሜኒስታን
ቱቫሉ
ኡጋንዳ
ዩክሬን
ዩናይቲድ_አራብ_ኤሚራትስ
እንግሊዝ
ዩናይትድ_ስቴትስ
ኡራጋይ
ኡዝቤክስታን
ቫኑአቱ
የቫቲካን ከተማ
ቨንዙዋላ
ቪትናም
የመን
ዛምቢያ
ዝምባቡዌ
"""
adv = """ 
ከዳርእዳር
ሩቅ
እንደገና
አጥጋቢ
ለ-ነበር
ምፅዋት
ብቻ
ደግሞ	
በጠቅላላ
ሁልጊዜ
የሆነሆነ
የትም
ከ-በፊት
በ-ኋላ
ከ-ታች
ትክክል
ቀስበቀስ
በድንገትያለእቅድ
እንዳጋጣሚ
ሳያወላውል
ልብለልብ
እዚህ
እዚህገደማ
ከእንግዲህ
በዚህምጊዜ
በዚህጊዜ
ወደቤት
ወደቤቱ
እንዴት
በእርግት
ወደመሀልአገር
በብዙድካም
በመጨረሻ
ወደፊት
በቁመቱ
ትንሽያነሰ
እንደዚሁ
ቃልበቃል
በአካቢውብቻ
ብዙጊዜ
በፍቅር
ርካሽ
ዝቅብሎ
በሀብት
እስከዚያድረስ
በዚህጊዜ
በጣም
ከልብ
ምንምአልቀረው
በጥንቃቄ
በመጨነቅ
የሆነሆነ
ገናአዲስ
ተቃረበ
አይደለም
አይደለም
አሁን
የትምቦታ
ብዙጊዜ
አንድ
ራሱ
ወደፊት
በግልጹ
በቃል
እነንደተለመደው
ምስራቅ
ላይላዩን
በጥንቃቄበተለየ
ጨከንብሎ
ምናልባት
የንግድ
ምናልባት
በየወቅቱ
ለዘለቄታው
ጥቂትበጥቂት
በቀጥታ
ምናልባት
ከሞተበኋላ
በተግባር
ጥብቅ
አብዛኛዎቹ
በቅርቡ
ለጉራ
የሙከራጊዜ
ከመጠንበላይ
ወዲያውኑልክ(ጊዜ)
በደንብ
ትክክለኛ
በጣም
በፍፁም
ቀለላልበሆነአኳኋን
ከዚህወዲያ
ከዚህጊዜጀምሮ
እስካሁን
ከልብ
ብቻውንሆነ
ብቻውን
ትንሽበትንሽ
የራሠ
በቅርብ
በጣም
ምንምአይል
አሰስቦ
በቁጠባ
ኣልፎአልፎ
ሳያቆርጥ
በዝግታ
አምሮበት
ያንጊዜ
ከዚያጊዜወዲህ
እዚያጋ
ጥቅጥቅብሎ
ሦስተኛ
ግን
በሙሉ
እንግዲህ
ዛሬማታ
በጣም
መላቅጡጠፋ
ከድካምና
ከልብ
በእውነተኛ
ሁለቴ
እጥፍሆኖ
ሳያቋርጥ
ባንድድምፅ
ባለማወቅ
ያለመምንምጥርጥር
የሚያሰጥም
ካሰበውበላይነበር
ክልክበላይ
ያለየሌለውን
ያሳዝናል
ሳያመነታ
በሁሉምዘንድ
ጣለጥርጥር
ቆራጥነት
በጣም
ሀብታም
በብልሀት
በጉጉት
በማይገባአኳኋን
ሀሆንብ
ተሳስቶ
አዎ
"""
adj = """ 
ናፈቀ
ታማኝ
ትሁት
የተራበ
ጅልነት
የሚያሳፍር
ህገወጥ
ባለጌ
ዝነኛ
ጅል
ሰፊ
ጥልቅ
መጥፎ
አዲስ
አስፈላጊ
የተጣለ
አሰቃቂ
ድንገተኛ
ቀሪ
ዝንጉ
ተስማሚ
መጨመር
ትክክለኛ
ተከሳሽ
ተጠበባባቂ
ብርቱ
በባለሙያ
ዘዴኛ
ገጎልማሳ
ከፍተኛ
ተጨማሪ
አማካሪ
ሩቅ
አባባሰ
አበራ
መሳይ
ጉድለት
ሌላ
የጥንት
ማንም
ጽኑ
ዋና
ደፋር
አቶማቲክ
አሰቃቂ
የኃላ
ክፉ
ቁጡ
ተራ
በባዶእጅ
ባዶእግር
መካን
ተራ
አይናፋር
ውብ
ተስማማ
ወዳጅ
ጠቃሚ
የተሻለ
መራራ
ጥቁር
ለፍላፊ
ፈዛዛ
ደነዝ
ሄደ
ጀግና
ብሩህ
ሰፊ
ተንሳፋፊ
ጠብደል
ገና
አብይ
ርካሽ
ጥንቁቅ
ንፁህ
ጥሩ
ትክክል
ምትልቅ
ነዳጅ
ተላላፊ
የተወሳሰበ
ትዕቢተኛ
የተባበረ
አስታራቂ
ባንድጊዜ
የቆረጠ
ተደነቀ
ብዙ
በጣም
ጠቃሚ
ድንገተኛ
ልባዊ
ወፍራም
ውድ
ደፋር
ተንኮለኛ
እብድ
ጠማማ
ሸውራራ
ጨካኝ
ጨዋ
ብልጥ
ተጠራጣሪ
አደገኛ
ጨለማ
ደንቆሮ
ተወዳጅ
አሳሳች
ጥልቅ
የተበላሸ
መከላከል
ጣፋጭ
እብድ
ታማኝ
ተወላጅ
ምስኪን
ታማኝ
የተለያየ
ትጉህ
ዘዴኛ
አደገኛ
ቆሻሻ
አፀያፊ
አሳፋሪ
ያልተያያዘ
የተለያየ
ብኩን
ሟሟ
ልዩ
የታወቀ
አሳዛኝ
የተለያዩ
ታዛዥ
አሳዛኝ
እጥፍ
ደረቅ
ደደብ
ዝግጁ
ምስራቃዊ
በቀላሉ
ቀላል
የማይነዛነዝ
አዋጅ
ደማም
የሚለጠጥ
ድንቅ
የጀማሪዎች
ክፍያለ
ዝነኛ
አጥብቆ
ፈረመ
ጥብቅ
የሚማረክ
በቂ
ጓጓ
የታወቀ
እንኳንሳቀር
የተሟላ
ምቹ
ሊቅ
ረጅም
የውጪ
ልምላሜ
ፈሪ
ደህና
ታማኝ
ራቀ
ሩቅ
አሰቃቂ
የደከመ
ጥቂት
የጋለ
የመጨረሻ
በመጨረሻ
ተገቢ
ጉልሕ
ብልጭልጭ
ዝርግ
በፍፁም
የማይረባ
ውጭአገር
መንታ
ወደፊት
የሚሰበር
ግልጽ
ትኩስ
ቀዝቃዛ
በከንቱ
ውርጭ
ጀግና
በብዛት
ለፍላፊ
ብልጭልጭ
ቸር
ረጋያለ
ቀስበቀስ
አሰቃቂ
ደስታ
ጥሩ
ትልቅ
ስግብግብ
አሰቃቂ
ጠንካራ
የተቀደሰ
ምስኪን
ግድየለሽ
የቆየ
አስጨነቀ
ግፈኛ
ልብለልብ
አረመኔያዊ
የተወረሰ
አስከፊ
የተማረ
አረርቆአሳቢ
"""

df = """ 
    የተጠላ
አስጸያፊ
መጥላት
አስጸያፊ
አስጸያፊ
አስጸያፊ ነገር
አጋግራቭ
ማባባስ
ተባብሷል
መባባስ
ጠበኛ
ጠበኝነት
ጠበኛ
ጠበኝነት
አሞክ
አሚክ
ቁጣ
ተቆጣ
አንግሪ
አንርሊሊ
በቁጣ
ተናደደ
አኒሞስ
ጠላትነት
አኒሜስ
ማናደድ
ብስጭት
ተበሳጭቷል
የሚያበሳጭ
ተቃዋሚ
ተቃዋሚነት
አቫሪሲ
አፍቃሪ
መጥፎ_ደም
መጥፎ_መርምር
ግልፍተኛ
ባፍል
ግራ ተጋባ
መጮህ
ጠበኛ
ድብድብ
ድብድብ
ጠብ አጫሪ
በጩኸት
መራራ
ምሬት
ያስቸግር
አስጨናቂ
ጫጩት
ጮራ
የክፍል_ፍቅር
የክፍል_ ስሜት
አስተያየት
መመኘት
መመኘት
መመኘት
ስቅለት
ስቅለት
ዳንደር
ዲሲዎች
ንቀት
መናቅ
መናቅ
መናቅ
ቢኖርም
አስጸያፊ
ርኩሰት
ዲያብሎስ
ተስፋ መቁረጥ
ተስፋ ቆርጧል
ንቀት
አለመደሰቶች
ደስ የማይል
ቅር ተሰኝቷል
ደስ የማይል
ደስ የማይል
ደስ የማይል
አለመበሳጨት
ዱጀን
ዱን
እንፉሪ
ጠላትነት
ተቆጣ
ቁጣ
የሚያስቀና
የሚያስቀና
ምቀኛ
በምቀኝነት
ምቀኝነት
ምቀኝነት
ክፋት
ማባባስ
ማባባስ
ጠቋሚ
ከባድ
የሚያበሳጭ
ቁጣ
አስፈፃሚ
ያስፈጽሙ
አፈፃፀም
ተስማሚ
ብስጭት
ብስጭት
ብስጭት
ተስፋ አስቆራጭ
ብስጭት
ፉሪ
በጣም ተናደደ
በቁጣ
ቁጣ
ሐሞት
ሐሞት ማድረግ
ያግኙ_
ድረስ
መዝናኛ
መያዣ
ያዝ
መያዝ
ጠጠር
ግሬዲ
ስግብግብ
አረንጓዴ-አይ
አረንጓዴ-ዐይን
አረንጓዴ-ዐይን_ሞንንት
አረንጓዴ-ዐይን_እንቆቅልሽ
ቅሬታ
ቅሬታ
ማጭበርበር
ቂም
ቂም
ማጉረምረም
ሀክክል
ጠለፋዎች
ትንኮሳ
ትንኮሳ
ትንኮሳ
ሀሪ
መጥላት
የጥላቻ
በጥላቻ
ጥላቻ
የልብ ህመም
ልብን ማቃጠል
ከፍተኛ_ዳኛ
አስተናጋጅ
ጠላት
በጠላትነት
ጠላትነት
ሁፊ
ሀፊሽ
ሀፊ
የተሳሳተ_ እርምጃ
የታመመ_መርምር
የማይታመም_
አለመመኘት
ያስነሳል
ዕጣን
ተናደደ
ተናደደ
ተቆጥቷል
በንዴት
ንዴት
ኢንሩሪ
ብስጭት
ተቆጣ
የሚያናድድ
ብስጭት
ኢራስክ
መደምሰስ
ሊጠፋ የሚችል
አይር
ብስጭት
ብስጭት
ተናደደ
የሚያበሳጭ
ብስጭት
ቅናት
በቅናት
ቅናት
livid
ግዴለሽነት
ውርደት
ተጸየፈ
መጥላት
እብድ
ማደን
እብድ
ማድድ
እብደት
ማሊፍ
ማሊፊክ
ብልሹነት
ወንድቮልቭ
ብልሹነት
መጥፎ
በወዳጅነት
ማሊክ
ክፋት
ማሊሲ
ተንኮል-አዘል
በተንኮል
ተንኮል
የተሳሳተ
አደገኛነት
የተሳሳተ አቅጣጫ
የተሳሳተ አቅጣጫዊ
የተሳሳተ አቅጣጫዊ
የተሳሳተ አመለካከት
የተሳሳተ አስተሳሰብ
የተሳሳተ አስተሳሰብ
የተሳሳተ ትምህርት
የተሳሳተ ትምህርት
ስህተት
የተሳሳተ አመለካከት
የተሳሳተ መረጃ
ግድያ
በግድያ
ግድያ
ናርክ
የተጣራ
የተጣራ
የተጣራ
ማሰናከል
ያስቀየማል
ጥፋት
መጨቆን
ወጣ ገባ
ቁጣ
በጣም ተናደደ
ከመጠን በላይ
ቀናተኛ
የተላጠ
አሳዳጅ
ስደት
ፔስኪ
ፔስኪ
ፔስተር
ተባረረ
የጤዛ እጢ
ቸነፈር
ተላላፊ በሽታ
ፒክ
ፓይክ
ብስጭት
ተቆጣ
በሽታ
ቸነፈር
ብቅ
ቅድመ ሁኔታ
ፕሮቶክ
ተቀስቅሷል
ፈጣን_ እርምጃ
ፈጣን_መርምር
ጨርቅ
ቁጣ
ራኮር
ራኮር
ቂም
ቂም ይይዛል
በቁጭት
ቂም
መክሰስ
በቀል
ሪል
ሪል
ሮል
ጮኸ
ትዕይንት
ውጤት
ንቀት
ተመልከት_r
ተመልከት_
አጭር_ምስል
ተናዳጅ
ቁስለት
ቢሆንም
ግልፍተኛ
ቸልተኝነት
ስፕሊን
ወጥ
ተወጋ
ሰልክ
ሰልኪ
ሰልኪ
ታንታለች
tantalize
ንዴት
ሻይ
ማሾፍ
ቁጣ
አረንጓዴው-ዐይን_ውስጥ
አረንጓዴ-አይን_ውስጥ
ስቃይ
እምብርት
እምብርት
እምብርት
በቀል
በቀል
መርዝ
ብስጭት
ብስጭት
ተበሳጭቷል
ብስጭት
ቪንዲክ
በቀል
በቀል
የበቀል ስሜት
ጦርነት መንገድ
በመተማመን
ቁጣ
ቁጣ
በቁጣ
ቁጣ
አስጸያፊ
አስጸያፊ
አስጸያፊ
በአስጸያፊ
ያሽከረክራል
አስጸያፊ
አስጸያፊ
የሚያስጠላ
አስጸያፊ
አስጠላኝ
በመጸየፍ
አስጸያፊ
አስጸያፊ
በመጸየፍ
የሚያስጠላ
በማበሳጨት
መሰልቸት
ብልሹ
እርኩስ
አስፈሪ
ውርደት
የሚጠላ
ውርደት
አስጸያፊ
ማቅለሽለሽ
ማቅለሽለሽ
ማቅለሽለሽ
ማቅለሽለሽ
ማቅለሽለሽ
የማቅለሽለሽ
ጫጫታ
ብልግና
ብልግና
መጥፎ
በሚገርም ሁኔታ
ያስከፋል
አፀያፊ
ወረፋ
መግፋት
እንደገና መመለስ
የሚያባርር
ሪገን
ዳግም መከላከል
የሚጠላ
የሚጠላ
መመለስ
ማፈግፈግ
አስጸያፊ
በመገፋት
አመፅ
አመጽ
በማመጽ
ነፍሳት
መሻር
የታመመ
የታመመ_
ታመመ
መታመም
እየታመመ
ህመምተኛ
ሰልችቶናል
ኣጥፋ
መጥፎ
ዊች
ክፉ
ዩኪ

"""
df = """ 
የተጠላ_የተጣላች 
አስጸያፊ
መጥላት
አስጸያፊ
አስጸያፊ
አስጸያፊ_ነገር
ማባባስ
ተባብሷል
መባባስ
አባባሰች
አባባሳው
አባባሱት
ጠበኛው
ጠበኛዋ
ጠበኞች
ጠበኝነት
ጠበኛ
ጠበኝነት
ቁጣ
ቁጡ
ተቆጣ
ተቆጣች
ተቆጡ
በቁጣ
ተናደደ
ተናደደች
ተናደዱ
ጠላትነት
ማናደድ
ተናደዱ
ተናደደች
አበሳጭ
አበሳጭው
አበሳጫት
አበሳጫቸው
ብስጭት
ብስጩወች
ብስጩ
ተበሳጭቷል
ተበሳጭታለች
ተበሳጭተዋል
የሚያበሳጭ 
ተቃዋሚ
ተቃወሙ
ተቃወመች
ተቃወመ
ተቃዋሚነት
መጥፎ_ደም
መጥፎ_መርምር
ግልፍተኛ
ግልፍተኛዋ
ግልፍተኛው
ባፍል
ግራ ተጋባ
መጮህ
ጮኸ
ጮኸች
ጠበኛ
ጠበኛዋ
ጠበኛው
ጠበኞች
ድብድብ
ድብድብ
ተድባደቡ
ተደበች
ተደባደቡ
ጠብ አጫሪ
ጠብ አጫሪው
ጠብ አጫሪዋ
ጠብ አጫሪዎች
በጩኸት
መራራ
ተመረረች
ተመረረ
ተመረሩ
ምሬት
ያስቸግር
ተቸገረች
ተቸገሩ
ተቸገረ
አስጨናቂ
ተጨነቁ
ተጨነቀች
ተጨነቀ
ጫጩት
ጮራ
የክፍል_ፍቅር
የክፍል_ስሜት
አስተያየት
መመኘት
መመኘት
መመኘት
ስቅለት
ስቅለት
ዳንደር
ዲሲዎች
ንቀት
ተናቀች
ተናቁ
ተናቀ
መናቅ
መናቅ
መናቅ
ቢኖርም
አስጸያፊ
ተጸያፉ
ተጸየፈች
ርኩሰት
ዲያብሎስ
ተስፋ_መቁረጥ
ተስፋ_ቆርጧል
ንቀት
አለመደሰቶች
ደስ_የማይል
ቅር_ተሰኝቷል
ቅር_ተሰኝታለች
ቅር_ተሰኝተዋል
ደስ_የማይል
አለመበሳጨት
ዱጀን
እንፉሪ
ጠላትነት
ተቆጣ
ቁጣ
የሚያስቀና
ቀናች
ቀኑ
ቀና
የሚያስቀና
ምቀኛ
በምቀኝነት
ምቀኝነት
ምቀኝነት
ተመቃኘ
ተመቃኘች
ተመቃኙ
ክፋት
ተከፋች
ተከፋ
ተከፉ
ማባባስ
አባባሰችው
አባባሰው
አባባሱት
ማባባስ
ጠቋሚ
ተቃዋሚ
ከባድ
የሚያበሳጭ
ቁጣ
አስፈፃሚ
ያስፈጽሙ
አፈፃፀም
ተስማሚ
ብስጭት
ብስጭት
ብስጭት
ተስፋ_አስቆራጭ
ብስጭት
ፉሪ
በጣም_ተናደደ
በቁጣ
ቁጣ
ሐሞት
ሐሞት_ማድረግ
ያግኙ
ድረስ
መዝናኛ
መያዣ
ያዝ
መያዝ
ጠጠር
ስግብግብ
አረንጓዴ-አይ
አረንጓዴ-ዐይን
አረንጓዴ-ዐይን_ሞንንት
አረንጓዴ-ዐይን_እንቆቅልሽ
ቅሬታ
ተቃረኑ
ተቃረነች
ተቃረኑ
ቅሬታ
ማጭበርበር
ተጭበረበሩ
ቂም
ተቀየመ
ተቀየመች
ተቀየሙ
ቂም
ማጉረምረም
አጉረመረሙ
አጉረመረመ
አጉረመረመች
ሀክክል
ጠለፋዎች
ትንኮሳ
ተተነኮሰች
ተተነኮሰ
ተተነኮሱ
ትንኮሳ
ትንኮሳ
መጥላት
የጥላቻ
በጥላቻ
ጥላቻ
የልብ_ህመም
ልብን_ማቃጠል
ከፍተኛ_ዳኛ
አስተናጋጅ
ጠላት
ተጣሉ
ተጣላች
ተጣላ
በጠላትነት
ጠላትነት
ሁፊ
ሀፊሽ
ሀፊ
የተሳሳተ_እርምጃ
የታመመ_መርምር
የማይታመም
አለመመኘት
ያስነሳል
ዕጣን
ተናደደ
ተናደደ
ተቆጥቷል
በንዴት
ንዴት
ብስጭት
ተቆጣ
ተቆጡ
ተቆጣች
የሚያናድድ
ብስጭት
ኢራስክ
መደምሰስ
ሊጠፋ_የሚችል
አይር
ብስጭት
ብስጭት
ተናደደ
የሚያበሳጭ
ብስጭት
ቅናት
ቅናች
ቀና
ቀኑ
ቀናች
በቅናት
ቅናት
ግዴለሽነት
ውርደት
ተጸየፈ
ተጸየፈች
ተጸየፉ
መጥላት
እብድ
ማደን
እብድ
ማድድ
እብደት
ማሊፍ
ማሊፊክ
ብልሹነት
ወንድቮልቭ
ብልሹነት
መጥፎ
በወዳጅነት
ማሊክ
ክፋት
ተከፋች
ተከፋ
ተከፉ
ተንኮል_አዘል
በተንኮል
ተንኮል
የተሳሳተ
አደገኛነት
የተሳሳተ_አቅጣጫ
የተሳሳተ_አቅጣጫዊ
የተሳሳተ_አቅጣጫዊ
የተሳሳተ_አመለካከት
የተሳሳተ_አስተሳሰብ
የተሳሳተ_አስተሳሰብ
የተሳሳተ_ትምህርት
የተሳሳተ_ትምህርት
ስህተት
የተሳሳተ_አመለካከት
የተሳሳተ_መረጃ
ግድያ
በግድያ
ግድያ
ናርክ
የተጣራ
የተጣራ
የተጣራ
ማሰናከል
ያስቀየማል
ጥፋት
መጨቆን
ወጣ_ገባ
ቁጣ
በጣም_ተናደደ
ከመጠን_በላይ
ቀናተኛ
የተላጠ
አሳዳጅ
ስደት
ፔስኪ
ፔስኪ
ፔስተር
ተባረረ
የጤዛ_እጢ
ቸነፈር
ተላላፊ_በሽታ
ፒክ
ፓይክ
ብስጭት
ተቆጣ
በሽታ
ቸነፈር
ብቅ
ተቀስቅሷል
ፈጣን_እርምጃ
ፈጣን_መርምር
ጨርቅ
ቁጣ
ራኮር
ራኮር
ቂም
ቂም_ይይዛል
በቁጭት
ቂም
መክሰስ
በቀል
ሪል
ሪል
ሮል
ጮኸ
ትዕይንት
ውጤት
ንቀት
ተመልከት
ተመልከት
አጭር_ምስል
ተናዳጅ
ቁስለት
ቢሆንም
ግልፍተኛ
ቸልተኝነት
ስፕሊን
ወጥ
ተወጋ
ሰልክ
ሰልኪ
ሰልኪ
ንዴት
ሻይ
ማሾፍ
ቁጣ
አረንጓዴው_ዐይን_ውስጥ
አረንጓዴ_አይን_ውስጥ
ስቃይ
እምብርት
እምብርት
እምብርት
በቀል
ተበቀለች
ተበቅለ
ተበቅሉ
መርዝ
ብስጭት
ብስጭት
ተበሳጭቷል
ብስጭት
በቀል
በቀል
የበቀል_ስሜት
ጦርነት_መንገድ
በመተማመን
ተማመነች
ተማመነ
ተማመኑ
ቁጣ
ቁጣ
በቁጣ
ቁጣ
አስጸያፊ
አስጸያፊ
አስጸያፊ
በአስጸያፊ
ያሽከረክራል
አስጸያፊ
አስጸያፊ
የሚያስጠላ
አስጸያፊ
አስጠላኝ
በመጸየፍ
አስጸያፊ
አስጸያፊ
በመጸየፍ
የሚያስጠላ
ተጠላ
ተጠላች
ተጠሉ
በማበሳጨት
መሰልቸት
ብልሹ
ተብልሸች
ተበላሸ
ተበላሹ
እርኩስ
አስፈሪ
ውርደት
የሚጠላ
ውርደት
አስጸያፊ
ማቅለሽለሽ
ማቅለሽለሽ
ማቅለሽለሽ
ማቅለሽለሽ
ማቅለሽለሽ
የማቅለሽለሽ
ጫጫታ
ብልግና
ብልግና
መጥፎ
በሚገርም_ሁኔታ
ያስከፋል
አፀያፊ
ወረፋ
መግፋት
እንደገና_መመለስ
የሚያባርር
ሪገን
ዳግም_መከላከል
የሚጠላ
የሚጠላ
መመለስ
ማፈግፈግ
አስጸያፊ
በመገፋት
አመፅ
አመጽ
በማመጽ
ነፍሳት
መሻር
የታመመ
የታመመ_
ታመመ
መታመም
እየታመመ
ህመምተኛ
ሰልችቶናል
ኣጥፋ
መጥፎ
ዊች
ክፉ
ተከፉ
ተከፉች
ተከፉ
"""
happy ="""
አድሚር
የሚደነቅ
የሚደነቅ
አድናቆት
አድንቅ
ጌጣጌጥ
ደስ_የሚል
ስግደት
መስገድ
ተጽዕኖ
አፍቃሪ
ፍቅር
የሚነካ
አማረኛ
አማቶሪ
አዋጪ
አሚክ
ተስማሚነት
ተግባቢ
በሰላም_መኖር
በሰላም
አሞር
አስቂኝ
የፍቅር_ስሜት
ይጠብቁ
ይጠብቁ
ጉጉት
አመሰግናለሁ
አድናቆት
ማጽደቅ
የሚያነቃቃ
አፃፃፍ
ማጽደቅ
ማጽደቅ
ጸድቋል
በማጽደቅ ላይ
ቀልድ
ቀልድ
አያይዝ
አባሪ
ጉጉት
ተነሳሽነት
ጉጉት
ጨረር
እየበራ
ቤክሬም
ድብርት
ማታለያ
ማታለል
መሆን
የሆነ
ጥቅማጥቅሞች
ተጠቃሚ
ተጠቃሚ_ሆነዋል
ተጠቃሚነት
ተጠቃሚ
ተጠቃሚ
በተጠቃሚነት
የበታች
ቸርነት
ደግ
በደግነት
ጥንቆላ
አስማት
ብልት
ብልትነት
ቦንደር
ወንድማማችነት
ወንድማዊ
ተንሳፋፊነት
የጥጃ_ፍቅር
መማረክ
ተማርኳል
የሚማርክ
መማረክ
መያዝ
እንክብካቤ
የበጎ_አድራጎት
ማራኪነት
ተደባልቋል
አይዞህ
ተደሰት
ደስተኛ
በደስታ
ደስተኛነት
ደስ_የሚል
ደስታ
ገደል_ተንጠልጣይ
ገደል_ማንጠልጠል
ገጠመ
መቀራረብ
ማጽናኛ
ምቹ
ምቾት
በምቾት
የሚያጽናና
አመስግን
የሚያስመሰግን
ተዛማጆች
ተኳኋኝነት
ተኳሃኝ
በተመጣጣኝ_ሁኔታ
አመች
እርካታ
እርካብ
እንኳን_አደረሳችሁ
እንኳን_ደስ_አላችሁ
ኮንሶል
ኮንሶል
ይዘት
ረክቷል
እርካታ
ጨፍልቅ
ደስታ
ደስ_ብሎኛል
ቀናተኛ
ያደሩ
ራስን_መወሰን
መሰጠት
በጉጉት
ጉጉት
የበለፀገ
ኢላን
ኢላት
እስቲ
ተደስቷል
እያዘነ
ደስታ
ደፋር
ስሜት
ስሜት_ቀስቃሽ
ርህራሄ
በስሜታዊነት
ርህራሄ
ስሜታዊ
ርህራሄ
መማክ
አስማተኛ
አስማተኛ
አስማት
ተወዳጅ
በፍቅር
ይደሰቱ
የሚስብ
አስደሳች
ግለት
ቀናተኛ
መግቢያ
ገብቷል
መግቢያ
የደስታ_ስሜት
መውጫ
ደስታ
አስደሳች
ተደስቷል
አስደሳች
ደስታ
መምከር
ሰፋፊዎች
በስፋት
ይጠብቁ
ተስፋ
የደስታ_ስሜት
የደስታ_ስሜት
በደስታ
ደስ_ይበል
ደስ_የሚል
በደስታ
ደስታ
በመደሰት
በደስታ
የጌጥ
ማራኪ
የሚስብ
ማራኪነት
ሞገስ
ተስማሚ
በጥሩ_ሁኔታ
ሞገስ
ተስማሚ
የማንነት_መሆን_ስሜት
የማንነት_መሆን_ስሜት
የባልንጀራ_ፍቅር
አብሮ_ተሰማኝ
ፌስታል
ፌስቲቫል
በዓል
ፍቅር
ፍቅር_መልካም
በፍቅር
ፍቅር
ወንድማማችነት
ወንድማዊ
ጓደኛ
ወዳጅ
ወዳጃዊነት
ወዳጃዊ
ማሟላት
ደስ_ብሎኛል
ደስታ
ደስታ
የሚያብረቀርቅ
ጨዋነት
ደስታ
ደስ_የሚል
በደስታ
ደስታ
ጨለምታ
ማቃለል
እየተደሰተ
ጥሩ
መልካም_አመታት
መልካም_ፈቃድ
መልካም_ምኞት
መልካም_ፈቃድ
ግራቲፊ
ደስ_የሚል
የሚያስደስት
በሚያስደስት_ሁኔታ
ደስታ
ደስተኛ
ሀፒሊሊ
በደስታ
ደስታ
ደስተኛ
ተደሰተ
ተደሰትኩ 
ተደሰቱ

"""

surprise = """
አድናቆት
ይደነቁ
ተገረመ
መደነቅ
አስገራሚ
በሚያስደንቅ_ሁኔታ
አስቶኒ
የተደነቀ
መደነቅ
ተገረመ
አስገራሚ
በሚያስደንቅ_ሁኔታ
መደነቅ
መደነቅ
በጣም_ተገረመ
አስገራሚ
ኣው
መደነቅ
አገው
የተደነቀ
ደንግጧል
አስከፊ
ባፍል
ግራ_መጋባት
ድብደባ
ቤቶት
ግራ_ተጋባ
ግራ_የሚያጋባ
ደብዛዛ
ደነዘዘ
ደነዘዘ
ድንቅ
ፍላባበርስት
ብልጭ_ድርግም_ብሏል
ፍሉሞክስ
አግኝ
ጠጠር
ማልቀስ
በእዳችን
ድንቅ
በሚያስደንቅ_ሁኔታ
አስደናቂ
ሚስጥራዊ
ያልተደባለቀ
ግራ መጋባት
እንቆቅልሽ
እንቆቅልሽ
እየተንቀጠቀጠ
መደናገጥ
መደናገጥ
ደንዝዞ
ደንግጧል
የተስተካከለ
ግርፋት
ስቱፔፊ
ተደነቀ
ስቱፕ
ስቱፊፊንግ
ደደብ
ደደብ
አጠናክር
እጅግ በጣም ጥሩ
ልዕለ
አስገራሚ
መደነቅ
ተገረመ
በሚገርም ሁኔታ
አስገራሚ
በሚገርም ሁኔታ
አስፈሪ
አስፈሪ
በሚያስፈራ_ሁኔታ
ነጎድጓድ
ከላይ
መንቀጥቀጥ
ይገርማል
ድንቅ
በሚያስደንቅ_ሁኔታ
መደነቅ
አስደናቂ
በሚያስደንቅ_ሁኔታ
"""
anger = """
የተጠላ
አስጸያፊ
መጥላት
አስጸያፊ
አስጸያፊ_ነገር
አጋግራቭ
ማባባስ
ተባብሷል
መባባስ
ጠበኛ
ጠበኝነት
ጠበኛ
ጠበኝነት
አሞክ
አሚክ
ቁጣ
ተቆጣ
አንግሪ
አንርሊሊ
በቁጣ
ተናደደ
አኒሞስ
ጠላትነት
አኒሜስ
ማናደድ
ብስጭት
ተበሳጭቷል
የሚያበሳጭ
ተቃዋሚ
ተቃዋሚነት
አቫሪሲ
አፍቃሪ
መጥፎ_ደም
መጥፎ_መርምር
ግልፍተኛ
ባፍል
ግራ_ተጋባ
መጮህ
ጠበኛ
ድብድብ
ድብድብ
ጠብ_አጫሪ
በጩኸት
መራራ
ምሬት
ያስቸግር
አስጨናቂ
ጫጩት
ጮራ
አስተያየት
ስቅለት
ስቅለት
ዳንደር
ዲሲዎች
ንቀት
መናቅ
መናቅ
መናቅ
ቢኖርም
አስጸያፊ
ርኩሰት
ዲያብሎስ
ተስፋ_መቁረጥ
ተስፋ_ቆርጧል
ንቀት
አለመደሰቶች
ቅር_ተሰኝቷል
ደስ_የማይል
አለመበሳጨት
ዱጀን
ዱን
እንፉሪ
ጠላትነት
ተቆጣ
ቁጣ
የሚያስቀና
የሚያስቀና
ምቀኛ
በምቀኝነት
ምቀኝነት
ምቀኝነት
ክፋት
ማባባስ
ማባባስ
ጠቋሚ
ከባድ
የሚያበሳጭ
ቁጣ
አስፈፃሚ
ያስፈጽሙ
አፈፃፀም
ተስማሚ
ብስጭት
ብስጭት
ብስጭት
ተስፋ_አስቆራጭ
ብስጭት
ፉሪ
በጣም_ተናደደ
በቁጣ
ቁጣ
ሐሞት
ሐሞት_ማድረግ
ያግኙ
ድረስ
መዝናኛ
መያዣ
ያዝ
መያዝ
ጠጠር
ግሬዲ
ስግብግብ
አረንጓዴ_ዐይን_ሞንንት
አረንጓዴ_ዐይን_እንቆቅልሽ
ቅሬታ
ቅሬታ
ማጭበርበር
ቂም
ቂም
ማጉረምረም
ሀክክል
ጠለፋዎች
ትንኮሳ
መጥላት
የጥላቻ
በጥላቻ
ጥላቻ
የልብ_ህመም
ልብን_ማቃጠል
ከፍተኛ_ዳኛ
አስተናጋጅ
ጠላት
በጠላትነት
ጠላትነት
ሁፊ
ሀፊሽ
ሀፊ
የተሳሳተ_እርምጃ
የታመመ_መርምር
የማይታመም
አለመመኘት
ያስነሳል
ዕጣን
ተናደደ
ተናደደ
ተቆጥቷል
በንዴት
ንዴት
ኢንሩሪ
ብስጭት
ተቆጣ
የሚያናድድ
ብስጭት
ኢራስክ
መደምሰስ
ሊጠፋ_የሚችል
አይር
ብስጭት
ብስጭት
ተናደደ
የሚያበሳጭ
ብስጭት
ቅናት
በቅናት
ቅናት
livid
ግዴለሽነት
ውርደት
ተጸየፈ
መጥላት
እብድ
ማደን
እብድ
ማድድ
እብደት
ማሊፍ
ማሊፊክ
ብልሹነት
ወንድቮልቭ
ብልሹነት
መጥፎ
በወዳጅነት
ማሊክ
ክፋት
ማሊሲ
ተንኮል_አዘል
በተንኮል
ተንኮል
የተሳሳተ
አደገኛነት
የተሳሳተ_አቅጣጫ
የተሳሳተ_አስተሳሰብ
የተሳሳተ_ትምህርት
ስህተት
የተሳሳተ_አመለካከት
የተሳሳተ_መረጃ
ግድያ
በግድያ
ግድያ
ናርክ
የተጣራ
የተጣራ
የተጣራ
ማሰናከል
ያስቀየማል
ጥፋት
መጨቆን
ወጣ_ገባ
ቁጣ
በጣም_ተናደደ
ቀናተኛ
የተላጠ
አሳዳጅ
ስደት
ፔስኪ
ፔስኪ
ፔስተር
ተባረረ
የጤዛ_እጢ
ቸነፈር
ተላላፊ_በሽታ
ፒክ
ፓይክ
ብስጭት
ተቆጣ
በሽታ
ቸነፈር
ብቅ
ቅድመ_ሁኔታ
ተቀስቅሷል
ፈጣን_እርምጃ
ፈጣን_መርምር
ጨርቅ
ቁጣ
ራኮር
ራኮር
ቂም
ቂም_ይይዛል
በቁጭት
ቂም
መክሰስ
በቀል
ሪል
ሪል
ሮል
ጮኸ
ትዕይንት
ውጤት
ንቀት
አጭር_ምስል
ተናዳጅ
ቁስለት
ቢሆንም
ግልፍተኛ
ቸልተኝነት
ስፕሊን
ወጥ
ተወጋ
ታንታለች
ንዴት
ሻይ
ማሾፍ
ቁጣ
አረንጓዴው_ዐይን_ውስጥ
አረንጓዴ_አይን_ውስጥ
ስቃይ
እምብርት
በቀል
መርዝ
ብስጭት
ተበሳጭቷል
ብስጭት
ቪንዲክ
በቀል
የበቀል_ስሜት
ጦርነት_መንገድ
በመተማመን
ቁጣ
በቁጣ
ቁጣ
አስጸያፊ
በአስጸያፊ
ያሽከረክራል
አስጸያፊ
አስጸያፊ
የሚያስጠላ
አስጸያፊ
አስጠላኝ
በመጸየፍ
አስጸያፊ
አስጸያፊ
በመጸየፍ
የሚያስጠላ
በማበሳጨት
መሰልቸት
ብልሹ
እርኩስ
አስፈሪ
ውርደት
የሚጠላ
ውርደት
አስጸያፊ
ማቅለሽለሽ
ጫጫታ
ብልግና
ብልግና
መጥፎ
በሚገርም ሁኔታ
ያስከፋል
አፀያፊ
ወረፋ
መግፋት
እንደገና_መመለስ
የሚያባርር
ሪገን
ዳግም_መከላከል
የሚጠላ
የሚጠላ
መመለስ
ማፈግፈግ
አስጸያፊ
በመገፋት
አመፅ
አመጽ
በማመጽ
ነፍሳት
መሻር
የታመመ
ታመመ
መታመም
እየታመመ
ህመምተኛ
ሰልችቶናል
ኣጥፋ
መጥፎ
ክፉ


"""
xc = word_tokenize(adj)
fg = word_tokenize(anger)
print(fg)
sd = '\''':\'Anger\''',\n\''.join(fg)
print(sd)
#s = se = '"|"'.join(xc)
#print(s)